TexasInstruments/mcupsdk-core-k3/test/drivers/mmcsd/test_mmcsd_raw_io/am62x-sk-lp/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM62x" --part "Default" --package "AMC" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM625-Q1" --package "FCBGA (AMC)" --variant "AM6254-G" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.0+4150"}
 */

/**
 * Import the modules used in this configuration.
 */
const mmcsd      = scripting.addModule("/drivers/mmcsd/mmcsd", {}, false);
const mmcsd1     = mmcsd.addInstance();
const mmcsd2     = mmcsd.addInstance();
const clock      = scripting.addModule("/kernel/dpl/clock");
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();
const mpu_armv76 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
mmcsd1.$name = "CONFIG_MMCSD_EMMC";

mmcsd2.$name        = "CONFIG_MMCSD_SD";
mmcsd2.moduleSelect = "MMC1";

clock.instance = "TIMER1";

debug_log.enableUartLog = true;
debug_log.uartTrace     = true;
debug_log.uartLog.$name = "CONFIG_UART0";

mpu_armv71.allowExecute = false;
mpu_armv71.size         = 31;
mpu_armv71.attributes   = "Device";
mpu_armv71.$name        = "REGISTER_REGION";

mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv72.size              = 7;
mpu_armv72.$name             = "TCMA_VEC";

mpu_armv73.baseAddr = 0x80000000;
mpu_armv73.size     = 31;
mpu_armv73.$name    = "DDR";

mpu_armv74.baseAddr   = 0x41010000;
mpu_armv74.size       = 15;
mpu_armv74.attributes = "NonCached";
mpu_armv74.$name      = "TCMB";

mpu_armv75.size       = 15;
mpu_armv75.attributes = "NonCached";
mpu_armv75.$name      = "TCMA";

mpu_armv76.baseAddr = 0x43C00000;
mpu_armv76.size     = 18;
mpu_armv76.$name    = "HSM_RAM";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
mmcsd1.MMC0.$suggestSolution                     = "MMC0";
mmcsd1.MMC0.CLK.$suggestSolution                 = "MMC0_CLK";
mmcsd1.MMC0.CMD.$suggestSolution                 = "MMC0_CMD";
mmcsd1.MMC0.DAT0.$suggestSolution                = "MMC0_DAT0";
mmcsd1.MMC0.DAT1.$suggestSolution                = "MMC0_DAT1";
mmcsd1.MMC0.DAT2.$suggestSolution                = "MMC0_DAT2";
mmcsd1.MMC0.DAT3.$suggestSolution                = "MMC0_DAT3";
mmcsd1.MMC0.DAT4.$suggestSolution                = "MMC0_DAT4";
mmcsd1.MMC0.DAT5.$suggestSolution                = "MMC0_DAT5";
mmcsd1.MMC0.DAT6.$suggestSolution                = "MMC0_DAT6";
mmcsd1.MMC0.DAT7.$suggestSolution                = "MMC0_DAT7";
mmcsd2.MMC1.$suggestSolution                     = "MMC1";
mmcsd2.MMC1.CLK.$suggestSolution                 = "MMC1_CLK";
mmcsd2.MMC1.CMD.$suggestSolution                 = "MMC1_CMD";
mmcsd2.MMC1.DAT0.$suggestSolution                = "MMC1_DAT0";
mmcsd2.MMC1.DAT1.$suggestSolution                = "MMC1_DAT1";
mmcsd2.MMC1.DAT2.$suggestSolution                = "MMC1_DAT2";
mmcsd2.MMC1.DAT3.$suggestSolution                = "MMC1_DAT3";
mmcsd2.MMC1.SDCD.$suggestSolution                = "MMC1_SDCD";
debug_log.uartLog.WKUP_UART.$suggestSolution     = "WKUP_USART0";
debug_log.uartLog.WKUP_UART.RXD.$suggestSolution = "WKUP_UART0_RXD";
debug_log.uartLog.WKUP_UART.TXD.$suggestSolution = "WKUP_UART0_TXD";
